Обработки/Reports/_ЗадолженностиИОстатокДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ЗадолженностиИОстатокДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыЗадолженности</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоВидуЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоВидуДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборСравненияОстаткаНаРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокМеньшеЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФорма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ЗадолженностиИОстатокДС/Forms/СозданиеОплат/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(Параметры.Отчет, Отчет);
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ОтчетОбъект.ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("Организация",									Отчет.Организация);
	Запрос.УстановитьПараметр("ГраницаОкончания",								Новый Граница(КонецДня(Отчет.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОтборПоВидуЗадолженности",						Отчет.ОтборПоВидуЗадолженности);
	Запрос.УстановитьПараметр("ВидыЗадолженности",								Отчет.ВидыЗадолженности);
	Запрос.УстановитьПараметр("ОтборПоВидуДоговораДоверительногоУправления",	Отчет.ОтборПоВидуДоговораДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидыДоговоровДоверительногоУправления",			Отчет.ВидыДоговоровДоверительногоУправления);
	Запрос.УстановитьПараметр("ОтборСравненияОстаткаНаРС",						Отчет.ОтборСравненияОстаткаНаРС);
	Запрос.УстановитьПараметр("ОстатокМеньшеЗадолженности",						Отчет.ОстатокМеньшеЗадолженности);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ТаблицаЗадолженностей	= Пакет[Пакет.Количество()-2].Выгрузить();
	ТаблицаОстатков			= Пакет[Пакет.Количество()-1].Выгрузить();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТаблицаЗадолженностей",	ТаблицаЗадолженностей);
	Запрос.УстановитьПараметр("ТаблицаОстатков",		ТаблицаОстатков);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЗадолженностей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ТаблицаЗадолженностей.Валюта КАК Валюта,
		|	ТаблицаЗадолженностей.СуммаЗадолженности КАК СуммаЗадолженности,
		|	ТаблицаЗадолженностей.Основание КАК Основание,
		|	ТаблицаЗадолженностей.ВидЗадолженности КАК ВидЗадолженности
		|ПОМЕСТИТЬ _Задолженность
		|ИЗ
		|	&ТаблицаЗадолженностей КАК ТаблицаЗадолженностей
		|ГДЕ
		|	ТаблицаЗадолженностей.СуммаЗадолженности > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОстатков.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ТаблицаОстатков.Банк КАК Банк,
		|	ТаблицаОстатков.РасчетныйСчет КАК РасчетныйСчет,
		|	ТаблицаОстатков.СуммаОстатка КАК СуммаОстатка,
		|	ТаблицаОстатков.Валюта КАК Валюта
		|ПОМЕСТИТЬ _Остаток
		|ИЗ
		|	&ТаблицаОстатков КАК ТаблицаОстатков
		|ГДЕ
		|	ТаблицаОстатков.РасчетныйСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_Задолженность.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Задолженность.Основание КАК ОснованиеЗадолженности,
		|	_Задолженность.СуммаЗадолженности КАК СуммаЗадолженности,
		|	_Остаток.Банк КАК Банк,
		|	_Остаток.РасчетныйСчет КАК БанковскийСчет,
		|	_Остаток.Валюта КАК Валюта,
		|	_Остаток.СуммаОстатка КАК ОстатокНаСчете,
		|	_Задолженность.СчетДоверительногоУправления.Наименование КАК СчетДоверительногоУправленияНаименование
		|ИЗ
		|	_Задолженность КАК _Задолженность
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Остаток КАК _Остаток
		|		ПО _Задолженность.СчетДоверительногоУправления = _Остаток.СчетДоверительногоУправления
		|			И _Задолженность.Валюта = _Остаток.Валюта
		|			И _Задолженность.СуммаЗадолженности <= _Остаток.СуммаОстатка
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетДоверительногоУправленияНаименование
		|ИТОГИ ПО
		|	СчетДоверительногоУправления,
		|	ОснованиеЗадолженности";
	
	ВыборкаСчетаДУ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСчетаДУ.Следующий() Цикл
		
		ВыборкаОснования = ВыборкаСчетаДУ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОснования.Следующий() Цикл
			
			Флаг = Истина;
			
			Выборка = ВыборкаОснования.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = Список.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				НоваяСтрока.Создать = Флаг;
				
				Флаг = Ложь;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОтчетОбъект, "Организация,ОтборПоВидуЗадолженности,ВидыЗадолженности,ОтборПоВидуДоговораДоверительногоУправления,
																																	       |ВидыДоговоровДоверительногоУправления,ОтборСравненияОстаткаНаРС,ОстатокМеньшеЗадолженности");
	Механизм = ОтчетОбъект.Метаданные().ПолноеИмя() + ".СоздатьДокументыНаСервере()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Для Каждого ТекСтрока Из Список Цикл
		
		Если НЕ ТекСтрока.Создать Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйДокумент = Документы.Оплата.СоздатьДокумент();
		
		НовыйДокумент.Дата							= ТекущаяДата();
		НовыйДокумент.Организация					= Отчет.Организация;
		НовыйДокумент.СчетДоверительногоУправления	= ТекСтрока.СчетДоверительногоУправления;
		НовыйДокумент.ВидДвижения					= Перечисления.ВидыДвижений.Расход;
		НовыйДокумент.ВидЗадолженности				= Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего;
		НовыйДокумент.МестоХранения					= Справочники.МестаХранения.ВнебиржевойРынок;
		НовыйДокумент.РасчетныйСчет					= ТекСтрока.БанковскийСчет;
		НовыйДокумент.ВалютаОплаты					= ТекСтрока.Валюта;
		НовыйДокумент.Контрагент					= Отчет.Организация.ЮрФизЛицо;
		НовыйДокумент.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
		НовыйДокумент.Комментарий					= "Документ создан при помощи отчета 'Задолженности и остаток денежных средств'";
		
		НоваяСтрока = НовыйДокумент.Основания.Добавить();
		
		НоваяСтрока.Основание	= ТекСтрока.ОснованиеЗадолженности;
		НоваяСтрока.Валюта		= ТекСтрока.Валюта;
		НоваяСтрока.Сумма		= ТекСтрока.СуммаЗадолженности;
		НоваяСтрока.СуммаОплаты	= ТекСтрока.СуммаЗадолженности;
		
		НачатьТранзакцию();
		
		СчетДУСтрока	= Строка(ТекСтрока.СчетДоверительногоУправления);
		СуммаСтрока		= Формат(ТекСтрока.СуммаЗадолженности, "ЧДЦ=2");
		ОснованиеСтрока	= Строка(ТекСтрока.ОснованиеЗадолженности);
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось создать документ 'Оплата' по счету ДУ '%1' на сумму %2 на основании %3", СчетДУСтрока, СуммаСтрока, ОснованиеСтрока));
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки;
		
		ТекСтрока.Создать	= Ложь;
		ТекСтрока.Документ	= НовыйДокумент.Ссылка;
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗначениеФлагов(Значение)
	
	Для Каждого ТекСтрока Из Список Цикл
		ТекСтрока.Создать = Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	
	ИзменитьЗначениеФлагов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	ИзменитьЗначениеФлагов(Ложь);
	
КонецПроцедуры
